Sanchogus/inverter_stm32g070/Inverter_G070KB/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FAN_EN_Pin GPIO_PIN_9
#define FAN_EN_GPIO_Port GPIOB
#define LED3_Pin GPIO_PIN_14
#define LED3_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_15
#define LED2_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_0
#define LED1_GPIO_Port GPIOA
#define OPA_I_U_Pin GPIO_PIN_1
#define OPA_I_U_GPIO_Port GPIOA
#define OPA_I_V_Pin GPIO_PIN_2
#define OPA_I_V_GPIO_Port GPIOA
#define OPA_I_SUM_Pin GPIO_PIN_3
#define OPA_I_SUM_GPIO_Port GPIOA
#define OPA_HV_Pin GPIO_PIN_4
#define OPA_HV_GPIO_Port GPIOA
#define OPA_VFO_Pin GPIO_PIN_5
#define OPA_VFO_GPIO_Port GPIOA
#define LOAD_EN_Pin GPIO_PIN_6
#define LOAD_EN_GPIO_Port GPIOC
#define ALERT_OV_Pin GPIO_PIN_3
#define ALERT_OV_GPIO_Port GPIOB
#define RELAY_EN_Pin GPIO_PIN_8
#define RELAY_EN_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
